In [1]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv("data/Datensatz.csv")

In [6]:
df.head()

,Unnamed: 0,Alter,Einkommen,Geschlecht,Zeit,KundeNr,Preis,Niederlassung
0,0,30,39919,0.0,29,K1814,NaN,Bayern
1,1,41,53430,0.0,27,K1544,NaN,Baden-Württemberg
2,2,64,73163,0.0,32,K1945,NaN,Baden-Württemberg
3,3,41,36761,0.0,44,K1825,NaN,Baden-Württemberg
4,4,35,42684,1.0,33,K1144,NaN,Nordrhein-Westfalen

In [13]:
# wie viele Autos wurden verkauft?
Anzahl_Autos = df["Preis"].notna().sum()
Anzahl_Autos

1104

In [15]:
#wie viel ist der höchst, mindest und durchschnittspreis der verkauften Autos?
Anzahl_Autos = df["Preis"].notna().describe()
Anzahl_Autos

count     1995
unique       2
top       True
freq      1104
Name: Preis, dtype: object